Articles/What_is_Docker/002.Backend.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-04-29 Tue 11:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Creating the Backend</title>
<meta name="author" content="Alfredo Mejia" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://cdn.jsdelivr.net/npm/bulma@1.0.4/css/bulma.min.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Creating the Backend</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge555343">Navigation</a></li>
<li><a href="#orgc56f999">Django</a>
<ul>
<li><a href="#orgbd4603d">Creating Django Project</a></li>
<li><a href="#orgb2f2225">Creating Django App &amp; Setting Up URLs</a></li>
<li><a href="#orge6ed484">Creating a Model</a></li>
<li><a href="#orge71b922">Create Another View That Returns All Rows From Table</a></li>
<li><a href="#orgd6eae06">Continue Finishing Register View</a></li>
<li><a href="#orgb7bf6c0">Creating Other Views</a></li>
<li><a href="#org2a96ab2">Comments to Making This Work</a></li>
<li><a href="#org52d71a8">Connecting to MySQL</a></li>
<li><a href="#org786f599">Notes</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orge555343" class="outline-2">
<h2 id="orge555343">Navigation</h2>
<div class="outline-text-2" id="text-orge555343">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Nav</th>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Links</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Index</td>
<td class="org-left">Notes Home</td>
<td class="org-left">&vert; <a href="../../index.html">html</a> &vert; <a href="../../index.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Prev</td>
<td class="org-left">Creating the Frontend</td>
<td class="org-left">&vert; <a href="./001.Frontend.html">html</a> &vert; <a href="./001.Frontend.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Articles/What_is_Docker">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Next</td>
<td class="org-left">Creating the Database</td>
<td class="org-left">&vert; <a href="./003.Database.html">html</a> &vert; <a href="./003.Database.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Articles/What_is_Docker">github</a> &vert;</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-orgc56f999" class="outline-2">
<h2 id="orgc56f999">Django</h2>
<div class="outline-text-2" id="text-orgc56f999">
<p>
We will be following the <a href="https://docs.djangoproject.com/en/5.1/">Django docs</a> to create our backend server. In addition, we'll be referring my other notes and tutorial on Django called <a href="../../Tutorials/Django_Polls_App/000.Notes.html">Django Polls App</a>.
</p>
</div>

<div id="outline-container-orgbd4603d" class="outline-3">
<h3 id="orgbd4603d">Creating Django Project</h3>
<div class="outline-text-3" id="text-orgbd4603d">
<div class="org-src-container">
<pre class="src src-bash"># Download python
sudo apt install python3

# Create venv
python3 -m venv myvenv

# Activate venv
source myvenv/bin/activate

# Download Django
pip install Django

# Bootstrap new project
django-admin startproject &lt;project-name&gt;

# Move directory
cd &lt;project-name&gt;

# Start server
python manage.py runserver

</pre>
</div>

<ul class="org-ul">
<li>Django will create a <code>manage.py</code> which allows you interact with this Django project in various ways</li>
<li><code>settings.py</code> are the settings and configurations of the Django project</li>
<li><code>urls.py</code> is the URLs declarations for the Django project</li>
</ul>
</div>
</div>
<div id="outline-container-orgb2f2225" class="outline-3">
<h3 id="orgb2f2225">Creating Django App &amp; Setting Up URLs</h3>
<div class="outline-text-3" id="text-orgb2f2225">
<div class="org-src-container">
<pre class="src src-bash">python manage.py startapp App
</pre>
</div>

<ul class="org-ul">
<li>Let's add a view called "register" in the <code>views.py</code></li>
<li>Then we are going to add a URL in the main <code>URLconf</code> as "What<sub>is</sub><sub>Docker</sub>/"</li>
<li>Then in the directory of "App" we will create a <code>URLconf</code> by first creating the file <code>urls.py</code></li>
<li>Then adding 'register/' as the endpoint that will reach the view called "register" we did in <code>views.py</code></li>
<li>So if we go to <a href="http://localhost:8000/What_is_Docker/register/">http://localhost:8000/What_is_Docker/register/</a> we should hit the view</li>
</ul>
</div>
</div>

<div id="outline-container-orge6ed484" class="outline-3">
<h3 id="orge6ed484">Creating a Model</h3>
<div class="outline-text-3" id="text-orge6ed484">
<ul class="org-ul">
<li>To start we will be using SQLite but later we will use MySQL</li>
<li>Modify the <code>models.py</code> and create the class with the appropriate member fields (age will be calculated at the front-end)</li>
<li>We then add our app to the <code>INSTALLED_APPS</code> in the setting file</li>
<li>Then we run <code>python.py manage.py makemigrations App</code></li>
<li>Then <code>python.py manage.py migrate App</code></li>
</ul>
</div>
</div>

<div id="outline-container-orge71b922" class="outline-3">
<h3 id="orge71b922">Create Another View That Returns All Rows From Table</h3>
<div class="outline-text-3" id="text-orge71b922">
<ul class="org-ul">
<li>We go to <code>views.py</code> in the app and create a function view called <code>get_all</code></li>
<li>Then we go to <code>URLconf</code> for app and create another URL called <code>get_all/</code></li>
<li>Inside the <code>get_all</code> method we require the HTTP method to only be "GET" and we return the rows as a JSON data</li>
<li><a href="http://localhost:8000/What_is_Docker/get_all/">http://localhost:8000/What_is_Docker/get_all/</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd6eae06" class="outline-3">
<h3 id="orgd6eae06">Continue Finishing Register View</h3>
<div class="outline-text-3" id="text-orgd6eae06">
<ul class="org-ul">
<li>In the register view we will accept POST methods</li>
<li>We will get the name and DOB from the post request and create a new person and add it to the table</li>
<li>We will return a json response with "status" as "error" or "ok"</li>
</ul>
</div>
</div>

<div id="outline-container-orgb7bf6c0" class="outline-3">
<h3 id="orgb7bf6c0">Creating Other Views</h3>
<div class="outline-text-3" id="text-orgb7bf6c0">
<ul class="org-ul">
<li>Not only do we have <code>get_all</code> and <code>register</code> end points</li>
<li>We are going to have <code>delete/&lt;id:person_id&gt;/</code> and <code>modify/&lt;id:person_id&gt;/</code></li>
<li>The delete one will delete a person from the database</li>
<li>The modify we only modify the name of the person</li>
</ul>
</div>
</div>

<div id="outline-container-org2a96ab2" class="outline-3">
<h3 id="org2a96ab2">Comments to Making This Work</h3>
<div class="outline-text-3" id="text-org2a96ab2">
<ul class="org-ul">
<li>I had to play around the Django's settings to make this work</li>
<li>For example, I took off the middleware that was responsible for csrf tokens</li>
<li>I added <code>CORS_ORIGIN_ALLOW_ALL</code> and <code>CSRF_TRUSTED_ORIGINS</code></li>
</ul>
</div>
</div>

<div id="outline-container-org52d71a8" class="outline-3">
<h3 id="org52d71a8">Connecting to MySQL</h3>
<div class="outline-text-3" id="text-org52d71a8">
<ul class="org-ul">
<li>Let's follow <a href="https://docs.djangoproject.com/en/5.1/ref/databases/">Django documentation</a> to adding databases</li>
<li>Step 1: Download mysqlclient <code>pip install mysqlclient</code></li>
<li>Step 2: Create database in MySQL <code>CREATE DATABASE &lt;dbname&gt; CHARACTER SET utf8;</code></li>
<li>Step 3: Go to <code>settings.py</code></li>
<li>Step 4: Change the default db to mysql</li>
<li>Step 5: Write info (connection settings) in this order: options, name, user, password, host, port, and then MySQL option files (e.g. <code>'HOST': 'localhost'</code>)</li>
<li>Step 6: Write client info in the <code>my.cnf</code> file in mysql server</li>
</ul>
</div>
</div>

<div id="outline-container-org786f599" class="outline-3">
<h3 id="org786f599">Notes</h3>
<div class="outline-text-3" id="text-org786f599">
<ul class="org-ul">
<li>Although not ideal we are going to use Django's own server</li>
<li>I know in the docs it says not to use Django's own server for prod environments but luckily this won't be a prod env, this is just for fun</li>
<li>Maybe later I'll come back and deploy Django on an Apache server</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
